/**
 * tactileGraph.js
 * @description    Draw dot graph & Edel files.
 * @fileoverview   Drawing library
 * @author         Hirotsugu Kaga
 * @version        0.1
 * @date           2016-10-09
 * @copyright      Copyright (c) Hirotsugu Kaga
 * @license        licensed under the MIT license.
 */

/*jshint bitwise:false,eqnull:true,newcap:false */

  var tactileGraphic = function() {
  var arr = [];
  var size = "A4"; //Paper size
  var sizeX = 599;
  var sizeY = 744;
  var l = 30; // Line height
  var w = 6;
  var h = 7;
  var r = 15;
  var fromX = 0;
  var fromY = 0;
  var canvas,ctx;
  var interval = 6;
  return {

          /////////////////////設定系メソッド///////////////////////
  setCanvas:function(id){
    canvas = document.getElementById(id);
    ctx = canvas.getContext('2d');
    var len = arr.length;
    for(i=0; i<len; i++){
      var x = arr[i] % 1000;
      var y = (arr[i] - X) / 1000;
      ctx.beginPath();
      ctx.arc(x, y, 1, 0, Math.PI*2, false);
      ctx.fill();
    }
  },

  setSize:function(str){
    size = str;
    switch(str){
      case "A4":
        sizeX = 599;
        sixeY = 744;
        break;
      case "B5":
        sizeX = 479;
        sizeY = 725;
        break;
      }
  },

  setInterval:function(num){
    interval = num;
  },

  setColor:function(color){
    ctx.fillStyle = color;
  },
         ///////////////////////描画系メソッド//////////////////////

  convertText:function(str){    //拗音などを記号の組み合わせに変換する
    var arr1 = [
    ['きゃ','拗か'],['きゅ','拗く'],['きょ','拗こ'],['しゃ','拗さ'],['しゅ','拗す'],
    ['しょ','拗そ'],['ちゃ','拗た'],['ちゅ','拗つ'],['ちょ','拗と'],['にゃ','拗な'],
    ['にゅ','拗ぬ'],['にょ','拗の'],['ひゃ','拗は'],['ひゅ','拗ふ'],['ひょ','拗ほ'],
    ['みゃ','拗ま'],['みゅ','拗む'],['みょ','拗も'],['りゃ','拗ら'],['りゅ','拗る'],
    ['りょ','拗ろ'],['いぇ','拗え'],['きぇ','拗け'],['しぇ','拗せ'],['ちぇ','拗て'],
    ['にぇ','拗ね'],['ひぇ','拗へ'],['すぃ','拗し'],['てぃ','拗ち'],['ぎゃ','小か'],
    ['ぎゅ','小く'],['ぎょ','小こ'],['じゃ','小さ'],['じゅ','小す'],['じょ','小そ'],
    ['ぢゃ','小た'],['ぢゅ','小つ'],['ぢょ','小と'],['びゃ','小は'],['びゅ','小ふ'],
    ['びょ','小ほ'],['うぃ','+い'],['うぇ','+え'],['うぉ','+お'],['くぁ','+か'],
    ['くぃ','+き'],['くぇ','+け'],['くぉ','+こ'],['つぁ','+た'],['つぃ','+ち'],
    ['つぇ','+て'],['つぉ','+と'],['ふぁ','+は'],['ふぃ','+ひ'],['ふぇ','+へ'],
    ['ふぉ','+ほ'],['ぐぁ','。か'],['ぐぃ','。き'],['ぐぇ','。け'],['ぐぉ','。こ'],
    ['ヴぁ','。は'],['ヴぃ','。ひ'],['ヴぇ','。へ'],['ヴぉ','。ほ'],['とぅ','+つ'],
    ['ずぃ','小し'],['でぃ','小ち'],['どぅ','。つ'],['てゅ','斜つ'],['ふゅ','斜ゆ'],
    ['ふょ','斜よ'],['でゅ','拡つ'],['ヴゅ','拡ゆ'],['ヴゅ','拡よ'],['が','濁か'],
    ['ぎ','濁き'],['ぐ','濁く'],['げ','濁け'],['ご','濁こ'],['ざ','濁さ'],
    ['じ','濁し'],['ず','濁す'],['ぜ','濁せ'],['ぞ','濁そ'],['だ','濁た'],
    ['ぢ','濁ち'],['づ','濁つ'],['で','濁て'],['ど','濁と'],['ば','濁は'],
    ['び','濁ひ'],['ぶ','濁ふ'],['べ','濁へ'],['ぼ','濁ほ'],['ぱ','半ほ'],
    ['ぴ','半ひ'],['ぷ','半ふ'],['ぺ','半へ'],['ぽ','半ほ'],['キャ','拗カ'],
    ['キュ','拗ク'],['キョ','拗コ'],['シャ','拗サ'],['シュ','拗ス'],['ショ','拗ソ'],
    ['チャ','拗タ'],['チュ','拗ツ'],['チョ','拗ト'],['ニャ','拗ナ'],['ニュ','拗ヌ'],
    ['ニョ','拗ノ'],['ヒャ','拗ハ'],['ヒュ','拗フ'],['ヒョ','拗ホ'],['ミャ','拗マ'],
    ['ミュ','拗ム'],['ミョ','拗モ'],['リャ','拗ラ'],['リュ','拗ル'],['リョ','拗ロ'],
    ['イェ','拗エ'],['キェ','拗ケ'],['シェ','拗セ'],['チェ','拗テ'],['ニェ','拗ネ'],
    ['ヒェ','拗ヘ'],['スィ','拗シ'],['ティ','拗チ'],['ギャ','小カ'],['ギュ','小ク'],
    ['ギョ','小コ'],['ジャ','小サ'],['ジュ','小ス'],['ジョ','小ソ'],['ヂャ','小タ'],
    ['ヂュ','小ツ'],['ヂョ','小ト'],['ビャ','小ハ'],['ビュ','小フ'],['ビョ','小ホ'],
    ['ウィ','+イ'],['ウェ','+エ'],['ウォ','+オ'],['クァ','+カ'],['クィ','+キ'],
    ['クェ','+ケ'],['クォ','+コ'],['ツァ','+タ'],['ツィ','+チ'],['ツェ','+テ'],
    ['ツォ','+ト'],['ファ','+ハ'],['フィ','+ヒ'],['フェ','+ヘ'],['フォ','+ホ'],
    ['グァ','。カ'],['グィ','。キ'],['グェ','。ケ'],['グォ','。コ'],['ヴァ','。ハ'],
    ['ヴィ','。ヒ'],['ヴェ','。ヘ'],['ヴォ','。ホ'],['トゥ','+ツ'],['ズィ','小シ'],
    ['ディ','小チ'],['ドゥ','。ツ'],['テュ','斜ツ'],['フュ','斜ユ'],['フョ','斜ヨ'],
    ['デュ','拡ツ'],['ヴュ','拡ユ'],['ヴュ','拡ヨ'],['ヴ','濁ウ'],['ガ','濁カ'],
    ['ギ','濁キ'],['グ','濁ク'],['ゲ','濁ケ'],['ゴ','濁コ'],['ザ','濁サ'],
    ['ジ','濁シ'],['ズ','濁ス'],['ゼ','濁セ'],['ゾ','濁ソ'],['ダ','濁タ'],
    ['ヂ','濁チ'],['ヅ','濁ツ'],['デ','濁テ'],['ド','濁ト'],['バ','濁ハ'],
    ['ビ','濁ヒ'],['ブ','濁フ'],['ベ','濁ヘ'],['ボ','濁ホ'],['パ','半ホ'],
    ['ピ','半ヒ'],['プ','半フ'],['ペ','半ヘ'],['ポ','半ホ']
    ];

    str += "";  //引数を文字列として扱わせる
    str = str.replace(/([0-9０１２３４５６７８９])/g, "数$1");  //全てのアラビア数字の直前に数符を置く
    str = str.replace(/([0-9０１２３４５６７８９])数/g, "$1");  //数符の直前に数字があったら、その数符を取り除く
    str = str.replace(/数数/g, "数");  //数符の連続があればそれを解消する
        //数字の直後にア行とラ行、AからJまでのアルファベットがあったら間に繋ぎ符を挿入する
    str = str.replace(/([0-9０１２３４５６７８９])([ろロﾛＪJｊjあアｱＡAａaいイｲＢBｂbうウｳＣCｃcるルﾙＤDｄdらラﾗＥEｅeれレﾚＧGｇgえエｴＦFｆfりリﾘＨHｈhおオｵＩIｉi])/g, "$1_$2");
    
    for(var i = 0 ; i < arr1.length ; i++){ //>配列の変換
      var regex = new RegExp(arr1[i][0], 'g');
      str = str.replace(regex,arr1[i][1]);
    }
    return str;
  },

  drawBraille:function( str, x, y, returnX){
    x = x || 0;
    y = y || 0;
    returnX = returnX || sizeX;
    var arrLetter = [
    ['あアｱ１1ＡAａa','1'],['いイｲ２2ＢBｂb','12'],
    ['うウｳ３3ＣCｃc','14'],['えエｴ６6ＦFｆf','124'],
    ['おオｵ９9ＩIｉi','24'],['かカｶ＊*','16'],
    ['きキｷ｛{','126'],['くクｸ','146'],
    ['けケｹ','1246'],['こコｺ＠@','246'],
    ['さサｻ','156'],['しシｼ','1256'],
    ['すスｽ','1456'],['せセｾ','12456'],
    ['そソｿ','2456'],['たタﾀＯoｏo','135'],
    ['ちチﾁＲRｒr','1235'],['つツﾂＮNｎn','1345'],
    ['てテﾃＱQｑq','12345'],['とトﾄＴTｔt','2345'],
    ['なナﾅＫKｋk','13'],['にニﾆＬLｌl','123'],
    ['ぬヌﾇＭMｍm','134'],['ねネﾈＰPｐp％%','1234'],
    ['のノﾉＳSｓs','234'],['はハﾊＵUｕu','136'],
    ['ひヒﾋＶVｖv','1236'],['ふフﾌＸXｘx','1346'],
    ['へヘﾍ＆&','12346'],['ほホﾎ','2346'],
    ['まマﾏＺZｚz','1356'],['みミﾐ[','12356'],
    ['むムﾑＹYｙy','13456'],['めメﾒ','123456'],
    ['もモﾓ]','23456'],['やヤﾔ／/分','34'],
    ['ゆユﾕ〒郵','346'],['よヨﾖ√根｝}','345'],
    ['らラﾗ5５ＥEｅe','15'],['りリﾘ8８ＨHｈh','125'],
    ['るルﾙ4４ＤDｄd','145'],['れレﾚ７7ＧGｇg','1245'],
    ['ろロﾛ０0ＪJｊj','245'],['わワﾜ’\'','3'],
    ['ゐヰ、，外＄$↓','56'],['ゑヱ、。．.句∋','256'],
    ['をヲｦ－','35'],['をヲｦ－','35'],
    ['んンﾝ零閉','356'],['八語','236'],
    ['濁・〃中','5'],['数','3456'],['　 &nbsp;無',''],['ーー三','25'],
    ['小＾^ぎギｷﾞじジｼﾞぢヂﾁﾞびビﾋﾞ↑','45'],['拗†￥\´','4'],
    ['半πΠ¶?ぱパﾊﾟ大','6'],['促っッｯ一','2'],
    ['＿_「」-‐継～：:','36'],['七＝=','2356'],
    ['斜‡ぴピﾋﾟ≠','46'],['？?＋+五疑','26'],
    ['二；;','23'],['！!！感六','235'],['｜|拡','456']];

    str += "";
    str = this.convertText(str);
    var arr = [];
    for(i=0;i<str.length;i++){  //>1文字毎に配列を作成
      var letter = str.charAt(i);
      arr.push(seek(letter));
    }
    
    function seek(letter){        //数字コードを取得
      var a = [
      ['\n','\n'], ['.','256'], ['\(','2356'], ['\)','2356'],
      ['\[','2356'], ['\]','2356'], ['\\','4'], ['\*','16'],
      ['?','26'], ['\{','2356'], ['\}','2356'], ['\^',' '],
      ['$','56'], ['-','36'], ['\|','456'], ['\/','34']]
      for(var i= 0 ; i < a.length ; i++){ //エスケープが必要な文字を先に文字列として比較
        if(letter === a[i][0])return a[i][1];
      }

      for(var j = 0 ; j < arrLetter.length ; j++){ //>
        if(arrLetter[j][0].match(letter)){
          return arrLetter[j][1];
        }
      }
      //alert("文字列に点字に変換出来ない文字が含まれています。");
      console.log("文字列に点字に変換出来ない文字が含まれています。");
      return "none";
    }
    
    this.arr2braille(arr,x,y);
  },

  arr2braille:function(arr,x,y,returnX){ //点字の描画処理/
    var j = k = 0;
    for(var i = 0 ; i < arr.length ; i++){         //>
      if(returnX < x + r * j + w){j = 0; k++;}//改行
      if(arr[i].match("1"))this.drawDot(x + r * j , y + l*k);
      if(arr[i].match("2"))this.drawDot(x + r * j , y + h + l*k);
      if(arr[i].match("3"))this.drawDot(x + r * j , y + h*2 + l*k);
      if(arr[i].match("4"))this.drawDot(x + w + r * j , y + l*k);
      if(arr[i].match("5"))this.drawDot(x + w + r * j , y + h + l*k);
      if(arr[i].match("6"))this.drawDot(x + w + r * j , y + h*2 + l*k);
      j++
      if(arr[i].match("\n")){j = 0; k++;}//改行
    }
  },

  drawBrailleRight:function(str, x, y){  //
    str +="";
    var length = str.length + 1;
    x -= length * r + 7;
    this.drawBraille(str, x,y);
  },

  drawBrailleMath:function(str, x, y){
    str=str.replace(/Α/g,‡a);str=str.replace(/Β/g,‡b);str=str.replace(/Δ/g,‡c);str=str.replace(/Ε/g,‡e);str=str.replace(/Φ/g,‡f);str=str.replace(/Γ/g,‡g);str=str.replace(/Ι/g,‡i);str=str.replace(/Κ/g,‡k);str=str.replace(/Λ/g,‡l);str=str.replace(/Μ/g,‡m);str=str.replace(/Ν/g,‡n);str=str.replace(/Ο/g,‡o);str=str.replace(/Π/g,‡p);str=str.replace(/Ρ/g,‡r);str=str.replace(/Σ/g,‡s);str=str.replace(/Τ/g,‡t);str=str.replace(/Υ/g,‡y);str=str.replace(/Ω/g,‡w);str=str.replace(/Ξ/g,‡x);str=str.replace(/Ψ/g,‡y);str=str.replace(/Ζ/g,‡z);str=str.replace(/Η/g,‡さ);str=str.replace(/Θ/g,‡す);str=str.replace(/Χ/g,‡へ);str=str.replace(/α/g,†a);str=str.replace(/β/g,†b);str=str.replace(/δ/g,†c);str=str.replace(/ε/g,†e);str=str.replace(/φ/g,†f);str=str.replace(/γ/g,†g);str=str.replace(/ι/g,†i);str=str.replace(/κ/g,†k);str=str.replace(/λ/g,†l);str=str.replace(/μ/g,†m);str=str.replace(/ν/g,†n);str=str.replace(/ο/g,†o);str=str.replace(/π/g,†p);str=str.replace(/ρ/g,†r);str=str.replace(/σ/g,†s);str=str.replace(/τ/g,†ｔ);str=str.replace(/υ/g,†y);str=str.replace(/ω/g,†w);str=str.replace(/ξ/g,†x);str=str.replace(/ψ/g,†y);str=str.replace(/ζ/g,†z);str=str.replace(/η/g,†さ);str=str.replace(/θ/g,†す);str=str.replace(/χ/g,†へ);str=str.replace(/＋/g,？);str=str.replace(/－/g,を);str=str.replace(/×/g,＊);str=str.replace(/÷/g,分);str=str.replace(/・/g,わ);str=str.replace(/／/g,｜分);str=str.replace(/\//g,｜分);str=str.replace(/±/g,？を);str=str.replace(/?/g,を？);str=str.replace(/：/g,中促);str=str.replace(/＝/g,ーー);str=str.replace(/≒/g,中ー);str=str.replace(/≠/g,‡ー);str=str.replace(/=/g,ーー);str=str.replace(/＞/g,？？);str=str.replace(/＜/g,をを);str=str.replace(/>/g,？？);str=str.replace(/</g,をを);str=str.replace(/≧/g,ヱヱ);str=str.replace(/≦/g,語語);str=str.replace(/（/g,語);str=str.replace(/(/g,語);str=str.replace(/）/g,ん);str=str.replace(/)/g,ん);str=str.replace(/｛/g,半き);str=str.replace(/{/g,半き);str=str.replace(/｝/g,よわ);str=str.replace(/}/g,よわ);str=str.replace(/［/g,半み);str=str.replace(/[/g,半み);str=str.replace(/］/g,もわ);str=str.replace(/］/g,もわ);str=str.replace(/｜/g,し);str=str.replace(/|/g,し);str=str.replace(/∽/g,半わ);str=str.replace(/⊥/g,んわ);str=str.replace(/∠/g,す);str=str.replace(/⊿/g,ゆ);str=str.replace(/⌒/g,こ);str=str.replace(/平行四辺形/g,｜分分);str=str.replace(/∪/g,ゆ);str=str.replace(/∩/g,く);str=str.replace(/→/g,ーた);str=str.replace(/←/g,こー);str=str.replace(/?/g,こーた);str=str.replace(/√/g,根);str=str.replace(/！/g,外！);str=str.replace(/!/g,外！);
    this.drawBraille(str, x,y);
  },

  drawDecapoint:function( str, posx, posy, returnX){
var sp=2;//文字の間隔
    x = x || 0;
    y = y || 0;
    var pos = posx;
    var line = posy;
    returnX = returnX || sizeX;
var a=[[4,2,3,4,1,4,1,4,2,3,5],[3,4,4,4,5,5,6,6,7,7,7]];
var b=[[1,1,1,1,2,3,1,4,1,4,1,2,3],[1,2,3,4,4,4,5,5,6,6,7,7,7]];
var c=[[2,3,1,1,2,3],[4,4,5,6,7,7]];
var d=[[2,3,4,4,2,3,4,1,4,1,4,2,3],[1,1,2,3,4,4,4,5,5,6,6,7,7]];
var e=[[2,3,1,2,3,1,2,3],[4,4,5,5,5,6,7,7]];
var f=[[4,3,5,3,3,4,3,3,3,3,1,3,2],[1,2,2,3,4,4,5,6,7,8,9,9,10]];
var g=[[4,2,3,4,1,4,1,4,2,3,4,4,4,2,3],[3,4,4,4,5,5,6,6,7,7,7,8,9,10,10]];
var h=[[1,1,1,1,2,3,1,3,1,3,1,3,4],[1,2,3,4,4,4,5,5,6,6,7,7,7]];
var i=[[1,1,1,1,1,2],[2,4,5,6,7,7]];
var j=[[3,3,3,3,3,3,1,3,2],[2,4,5,6,7,8,9,9,10]];
var k=[[1,1,1,1,3,1,2,1,2,1,3],[1,2,3,4,4,5,5,6,6,7,7]];
var l=[[1,1,1,1,1,1,1,2],[1,2,3,4,5,6,7,7]];
var m=[[1,2,3,4,5,1,3,5,1,3,5,1,3,5,6],[4,4,4,4,4,5,5,5,6,6,6,7,7,7,7]];
var n=[[1,2,3,1,3,1,3,1,3,4],[4,4,4,5,5,6,6,7,7,7]];
var o=[[2,3,1,4,1,4,2,3],[4,4,5,5,6,6,7,7]];
var p=[[1,1,2,3,1,4,1,4,1,2,3,1,1,1],[3,4,4,4,5,5,6,6,7,7,7,8,9,10]];
var q=[[4,2,3,4,1,4,1,4,2,3,4,4,4,4],[3,4,4,4,5,5,6,6,7,7,7,8,9,10]];
var r=[[1,2,3,1,1,1],[4,4,4,5,6,7]];
var s=[[4,3,3,1,3,2],[3,4,5,6,6,7]];
var t=[[1,1,1,2,1,1,1,2],[2,3,4,4,5,6,7,7]];
var u=[[1,3,1,3,1,3,1,2,3,4],[4,4,5,5,6,6,7,7,7,7]];
var v=[[1,4,1,4,2,3,2],[4,4,5,5,6,6,7]];
var w=[[1,4,7,1,4,7,2,3,5,6,2,5],[4,4,4,5,5,5,6,6,6,6,7,7]];
var x=[[1,1,2,2,3,3,4,4,5,5],[4,7,4,7,5,6,4,7,4,7]];
var y=[[1,2,4,2,4,2,4,2,3,4,4,4,2,3],[4,4,4,5,5,6,6,7,7,7,8,9,10,10]];
var z=[[1,2,3,4,3,2,1,2,3,4],[4,4,4,4,5,6,7,7,7,7]];
var A=[[7,8,6,7,8,5,7,8,4,5,6,7,8,3,7,8,2,7,8,1,2,3,6,7,8,9],[1,1,2,2,2,3,3,3,4,4,4,4,4,5,5,5,6,6,6,7,7,7,7,7,7,7]];
var B=[[1,2,3,4,5,2,3,6,2,3,6,2,3,4,5,2,3,6,2,3,6,1,2,3,4,5],[1,1,1,1,1,2,2,2,3,3,3,4,4,4,4,5,5,5,6,6,6,7,7,7,7,7]];
var C=[[3,4,5,2,6,1,2,6,7,1,2,1,2,6,7,2,6,3,4,5],[1,1,1,2,2,3,3,3,3,4,4,5,5,5,5,6,6,7,7,7]];
var D=[[1,2,3,4,5,2,3,6,2,3,6,7,2,3,6,7,2,3,6,7,2,3,6,1,2,3,4,5],[1,1,1,1,1,2,2,2,3,3,3,3,4,4,4,4,5,5,5,5,6,6,6,7,7,7,7,7]];
var E=[[1,2,3,4,5,6,7,2,3,7,2,3,5,2,3,4,5,2,3,5,2,3,7,1,2,3,4,5,6,7],[1,1,1,1,1,1,1,2,2,2,3,3,3,4,4,4,4,5,5,5,6,6,6,7,7,7,7,7,7,7]];
var F=[[1,2,3,4,5,6,7,2,3,7,2,3,5,2,3,4,5,2,3,5,2,3,1,2,3,4],[1,1,1,1,1,1,1,2,2,2,3,3,3,4,4,4,4,5,5,5,6,6,7,7,7,7]];
var G=[[3,4,5,2,6,1,2,1,2,1,2,4,5,6,7,2,5,6,3,4,5],[1,1,1,2,2,3,3,4,4,5,5,5,5,5,5,6,6,6,7,7,7]];
var H=[[1,2,3,4,6,7,8,2,3,7,2,3,7,2,3,4,5,6,7,2,3,7,2,3,7,1,2,3,4,6,7,8],[1,1,1,1,1,1,1,2,2,2,3,3,3,4,4,4,4,4,4,5,5,5,6,6,6,7,7,7,7,7,7,7]];
var I=[[1,2,3,4,2,3,2,3,2,3,2,3,2,3,1,2,3,4],[1,1,1,1,2,2,3,3,4,4,5,5,6,6,7,7,7,7]];
var J=[[1,1,2,2,3,3,3,3,3,3,3,4,4,4,4,4,4,5],[6,7,1,7,1,2,3,4,5,6,7,1,2,3,4,5,6,1]];
var K=[[1,2,3,4,6,7,2,3,6,2,3,5,2,3,4,5,2,3,5,6,2,3,6,7,1,2,3,4,6,7,8],[1,1,1,1,1,1,2,2,2,3,3,3,4,4,4,4,5,5,5,5,6,6,6,6,7,7,7,7,7,7,7]];
var L=[[1,2,3,4,2,3,2,3,2,3,2,3,2,3,6,1,2,3,4,5,6],[1,1,1,1,2,2,3,3,4,4,5,5,6,6,6,7,7,7,7,7,7]];
var M=[[1,1,2,2,2,2,2,2,2,3,3,3,4,4,5,5,6,6,7,8,9,9,10,10,10,10,10,10,10,11,11,11,11,11,11,11,12,12],[1,7,1,2,3,4,5,6,7,2,3,7,3,4,4,5,6,7,5,4,3,7,1,2,3,4,5,6,7,1,2,3,4,5,6,7,1,7]];
var N=[[1,2,7,8,9,2,3,8,2,3,4,8,2,4,5,8,2,5,6,8,2,6,7,8,1,2,3,7,8,9],[1,1,1,1,1,2,2,2,3,3,3,3,4,4,4,4,5,5,5,5,6,6,6,6,7,7,7,7,7,7]];
var O=[[3,4,2,5,1,2,5,6,1,2,5,6,1,2,5,6,2,5,3,4],[1,1,2,2,3,3,3,3,4,4,4,4,5,5,5,5,6,6,7,7]];
var P=[[1,2,3,4,5,2,3,6,2,3,6,2,3,4,5,2,3,2,3,1,2,3,4],[1,1,1,1,1,2,2,2,3,3,3,4,4,4,4,5,5,6,6,7,7,7,7]];
var Q=[[3,4,2,5,1,2,5,6,1,2,5,6,1,2,5,6,2,5,3,4,5,4,3],[1,1,2,2,3,3,3,3,4,4,4,4,5,5,5,5,6,6,7,7,8,9,10]];
var R=[[1,2,3,4,5,2,3,6,2,3,6,2,3,4,5,2,3,5,2,3,6,1,2,3,4,7],[1,1,1,1,1,2,2,2,3,3,3,4,4,4,4,5,5,5,6,6,6,7,7,7,7,7]];
var S=[[6,7,5,8,5,4,5,4,5,1,4,2,3],[1,1,2,2,3,4,4,5,5,6,6,7,7]];
var T=[[1,2,3,4,5,6,7,8,1,4,5,8,4,5,4,5,4,5,4,5,3,4,5,6],[1,1,1,1,1,1,1,1,2,2,2,2,3,3,4,4,5,5,6,6,7,7,7,7]];
var U=[[1,2,2,2,2,2,2,3,3,3,3,3,3,3,4,4,5,6,6,7,7,7,7,7,7,8],[1,1,2,3,4,5,6,1,2,3,4,5,6,7,1,7,7,1,7,1,2,3,4,5,6,1]];
var V=[[1,2,2,2,2,2,2,2,3,3,3,3,3,3,3,4,4,5,6,7,7,8,8,9],[1,1,2,3,4,5,6,7,1,2,3,4,5,6,7,1,6,5,4,1,3,1,2,1]];
var W=[[1,2,2,2,2,2,2,2,3,3,3,3,3,3,3,4,4,5,6,7,7,8,8,8,8,8,8,8,9,9,9,9,9,9,9,10,10,11,12,13,13,14,14,15],[1,1,2,3,4,5,6,7,1,2,3,4,5,6,7,1,6,5,4,1,3,1,2,3,4,5,6,7,1,2,3,4,5,6,7,1,6,5,4,1,3,1,2,1]];
var X=[[1,1,2,2,2,2,3,3,3,3,3,4,4,4,5,5,5,6,6,6,6,6,7,7,7,7,8,8],[1,7,1,2,6,7,1,2,3,5,7,1,3,4,4,5,7,1,3,5,6,7,1,2,6,7,1,7]];
var Y=[[1,2,2,3,3,3,3,4,4,4,4,4,4,5,5,5,5,6,6,6,7,7,8],[1,1,2,1,2,3,7,1,3,4,5,6,7,4,5,6,7,1,3,7,1,2,1]];
var Z=[[1,1,1,1,2,2,2,2,3,3,3,3,4,4,4,4,5,5,5,5,6,6,6,6],[1,2,6,7,1,5,6,7,1,4,5,7,1,3,4,7,1,2,3,7,1,2,6,7]];
var n1=[[1,2,3,2,2,2,1,2,3],[3,3,3,4,5,6,7,7,7]];
var n2=[[2,3,1,4,4,3,2,1,2,3,4],[2,2,3,3,4,5,6,7,7,7,7]];
var n3=[[2,3,1,4,4,3,4,1,4,2,3],[1,1,2,2,3,4,5,6,6,7,7]];
var n4=[[6,5,4,3,5,2,5,1,2,3,4,5,6,5],[1,2,3,4,4,5,5,6,6,6,6,6,6,7]];
var n5=[[3,4,2,1,1,2,3,4,1,4,2,3],[1,1,2,3,4,4,4,5,6,6,7,7]];
var n6=[[4,3,2,1,3,1,4,1,4,2,3],[1,2,3,4,4,5,5,6,6,7,7]];
var n7=[[3,4,5,6,7,6,5,4,3,2,1],[4,4,4,4,4,5,6,7,8,9,10]];
var n8=[[2,3,1,4,1,4,2,3,1,4,1,4,2,3],[1,1,2,2,3,3,4,4,5,5,6,6,7,7]];
var n9=[[2,3,1,4,1,4,2,4,3,2,1],[4,4,5,5,6,6,7,7,8,9,10]];
var n0=[[2,3,1,4,1,4,2,3],[4,4,5,5,6,6,7,7]];
var peri=[[1],[7]];
var con=[[1,2],[8,7]];
var ex=[[1,1,1,1,1,1],[1,2,3,4,5,7]];
var qu=[[1,1,1,1,1,2],[1,3,4,5,7,2]];
var bar=[[1,2,3],[6,6,6]];
var apo=[[1,2],[2,1]];
var colo=[[1,1],[5,7]];
var semi=[[1,2,2],[8,5,7]];
var asta=[[1,1,2,3,3,3,4,4,4,4,4,5,5,5,6,7,7],[3,5,4,1,4,7,2,3,4,5,6,1,4,7,4,3,5]];
var lpar=[[1,1,1,1,2,2,3,3,4,4,],[4,5,6,7,3,8,2,9,1,10]];
var rpar=[[1,1,2,2,3,3,4,4,4,4],[1,10,2,9,3,8,4,5,6,7]];
var lbra=[[1,1,2,2,2,2,3,3],[5,6,4,5,6,7,4,7]];
var rbra=[[1,1,2,2,2,2,3,3],[4,7,4,5,6,7,5,6]];
var def=[[1,1,1,1,1,1,2,2,3,3,4,4,5,5,5,5,5,5],[2,3,4,5,6,7,2,7,2,7,2,7,2,3,4,5,6,7]];
var k01=[[1,2,2,3,3,4,4,5,5,5,5,5,6,7,8,8,9,9,10,10,10],[1,1,10,1,9,1,8,1,4,5,6,7,1,1,1,5,1,4,1,2,3]];
var k02=[[1,2,3,4,4,4,4,4,4,4,5,6],[6,5,4,3,5,6,7,8,9,10,2,1]];
var k03=[[1,1,1,2,3,4,4,5,5,5,5,6,6,7,7,8,8,9,9,9,9,9],[3,4,5,3,3,3,10,1,2,3,10,3,10,3,9,3,8,3,4,5,6,7]];
var k04=[[1,2,2,3,3,4,4,5,5,5,5,5,5,5,5,6,6,7,7,8,8,9],[10,3,10,3,10,3,10,3,4,5,6,7,8,9,10,3,10,3,10,3,10,10]];
var k05=[[1,1,2,2,3,3,4,4,5,5,5,6,6,6,7,7,7,7,7,7,7,7,7,7,8,9,10],[3,9,3,8,3,7,3,6,3,5,10,3,4,10,1,2,3,4,5,6,7,8,9,10,3,3,3]];
var k06=[[1,2,2,3,3,4,4,4,5,5,5,5,5,5,6,6,7,7,8,8,9,9,9,9,9,9],[3,3,10,3,9,3,7,8,1,2,3,4,5,6,3,10,3,10,3,9,3,4,5,6,7,8]];
var k07=[[1,2,2,3,3,4,4,5,5,5,5,5,5,5,5,5,5,6,6,7,7,8,8,9],[5,2,5,2,5,2,5,1,2,3,4,5,6,7,8,9,10,2,5,2,5,2,5,5]];
var k08=[[1,2,2,3,4,4,5,5,6,6,7,7,8,8,9,9,9,9,9],[3,1,2,1,1,10,1,9,1,8,1,7,1,6,1,2,3,4,5]];
var k09=[[1,2,3,3,3,4,4,5,5,6,6,7,7,8,8,8,8,8,8,9,10],[5,4,1,2,3,3,10,3,10,3,10,3,9,3,4,5,6,7,8,3,3]];
var k10=[[1,1,2,2,3,3,4,4,5,5,6,6,7,7,8,8,9,9,9,9,9,9,9,9,9],[2,10,2,10,2,10,2,10,2,10,2,10,2,10,2,10,2,3,4,5,6,7,8,9,10]];
var k11=[[1,2,3,4,4,4,4,4,4,4,4,5,5,6,6,7,7,8,8,8,8,8,8,8,8,9,10],[4,4,4,1,2,3,4,5,6,7,10,4,10,4,10,4,9,1,2,3,4,5,6,7,8,4,4]];
var k12=[[1,1,1,2,2,2,3,4,5,6,7,7,7],[1,4,10,2,5,10,10,10,9,8,5,6,7]];
var k13=[[1,1,2,2,3,3,4,4,5,5,6,6,6,7,7,7,8,8,8,9,9,9],[1,10,1,9,1,8,1,7,1,6,1,5,7,1,4,8,1,3,9,1,2,10]];
var k14=[[1,2,3,3,3,3,3,3,3,3,4,4,5,5,6,6,7,7,8,8,8,9,9,9,10,10,10],[4,4,1,2,3,4,5,6,7,8,4,9,4,10,4,10,4,10,4,7,10,4,7,10,4,5,6]];
var k15=[[1,2,2,3,3,4,4,5,6,7,8,9,9],[1,2,10,3,10,4,10,9,8,7,6,4,5]];
var k16=[[1,1,1,2,2,2,3,3,4,4,4,5,5,5,6,6,6,7,7,7,8,8,8,8,8,8,8],[4,5,6,1,2,3,1,4,1,4,10,1,4,10,1,4,9,1,4,8,1,2,3,4,5,6,7]];
var k17=[[1,2,2,3,3,3,4,4,4,5,5,5,5,5,5,5,6,6,7,8,9],[5,3,5,3,5,10,3,5,9,2,3,4,5,6,7,8,1,5,5,5,5]];
var k18=[[1,1,1,1,1,1,2,3,4,4,4,4,4,4,5,6,7,8,9,9,9,9],[2,3,4,5,6,10,10,10,2,3,4,5,6,10,10,9,8,7,3,4,5,6]];
var k19=[[1,2,2,3,3,4,4,4,5,5,5,6,6,6,7,7,7,7,7,7,8,8,9,9,10],[4,1,4,1,4,1,4,10,1,4,10,1,4,9,1,4,5,6,7,8,1,4,1,4,4]];
var k20=[[3,3,3,3,3,3,3,3,3,3,4,5,6],[1,2,3,4,5,6,7,8,9,10,4,5,6]];
var k21=[[1,2,2,3,3,4,4,5,5,6,6,7,7,7,7,7,7,7,8,9,10],[3,3,10,3,10,3,10,3,9,3,8,1,2,3,4,5,6,7,3,3,3]];
var k22=[[1,2,2,3,3,4,4,5,5,6,6,7,7,8,8,9,9,10],[10,3,10,3,10,3,10,3,10,3,10,3,10,3,10,3,10,10]];
var k23=[[1,1,2,2,2,3,3,3,4,4,5,5,5,6,6,6,7,7,7,8,8,9,9],[1,10,1,5,9,1,6,8,1,7,1,6,8,1,5,9,1,4,10,1,3,1,2]];
var k24=[[1,2,2,3,3,4,4,5,5,5,5,5,5,5,5,6,6,7,7,7,8,8,9],[3,3,9,3,8,3,7,1,2,3,6,7,8,9,10,3,5,3,4,6,3,7,8]];
var k25=[[1,2,3,4,5,5,5,5,5,5],[10,9,8,7,1,2,3,4,5,6]];
var k26=[[1,2,3,4,7,8,9,10],[8,7,6,5,5,6,7,8]];
var k27=[[1,1,1,1,1,1,1,1,2,2,3,3,4,4,5,5,6,6,7,7,8,8,9,9],[1,2,3,4,5,6,7,8,4,9,4,10,4,10,4,10,4,10,4,10,4,10,4,10]];
var k28=[[1,1,2,2,3,3,4,4,5,5,6,6,7,7,8,8,9,9,10,10,10,10,10],[2,10,2,10,2,10,2,10,2,10,2,10,2,9,2,8,2,7,2,3,4,5,6]];
var k29=[[1,2,3,4,5,6,7,8,9,10],[7,6,5,4,4,5,6,7,8,9]];
var k30=[[1,1,2,2,3,3,4,5,5,5,5,5,5,5,5,5,5,6,7,7,8,8,9,9],[3,8,3,7,3,6,3,1,2,3,4,5,6,7,8,9,10,3,3,6,3,7,3,8]];
var k31=[[1,2,2,3,3,4,4,5,5,5,6,6,6,7,7,8,8,9,9,10,10,10],[1,1,6,1,7,1,8,1,7,9,1,6,10,1,6,1,5,1,4,1,2,3]];
var k32=[[1,1,1,2,2,2,3,3,3,4,4,4],[1,4,7,2,5,8,3,6,9,4,7,10]];
var k33=[[1,1,2,2,3,3,4,4,5,5,6,6,7,7,7,8,9,10],[9,10,8,10,7,10,6,10,5,10,4,10,3,7,9,8,9,10]];
var k34=[[1,1,2,2,3,3,4,5,5,6,6,7,7,8,9,10],[4,10,5,9,6,8,7,6,8,5,9,4,10,3,2,1]];
var k35=[[1,1,2,2,3,3,4,4,4,4,4,4,4,5,5,5,6,6,6,7,7,7,8,8,8,9,9,9],[2,5,2,5,2,5,2,3,4,5,6,7,8,2,5,9,2,5,10,2,5,10,2,5,10,2,5,10]];
var k36=[[1,2,3,4,4,4,4,4,4,4,4,4,4,5,6,7,7,8,8,9,9,10,10],[3,3,3,1,2,3,4,5,6,7,8,9,10,3,3,3,7,3,6,3,5,3,4]];
var k38=[[1,2,2,3,3,4,4,5,5,6,6,7,7,8,8,8,8,8,8,8,8,8,9,10],[10,2,10,2,10,2,10,2,10,2,10,2,10,2,3,4,5,6,7,8,9,10,10,10]];
var k40=[[1,1,2,2,2,3,3,3,4,4,4,5,5,5,6,6,6,7,7,7,8,8,8,9,9,9,9,9,9,9,9,9],[2,10,2,6,10,2,6,10,2,6,10,2,6,10,2,6,10,2,6,10,2,6,10,2,3,4,5,6,7,8,9,10]];
var k41=[[1,2,2,3,3,3,4,4,4,5,5,5,6,6,6,7,7,7,8,8,8,9,9,9,10,10,10,10],[4,1,4,1,4,10,1,4,10,1,4,10,1,4,10,1,4,10,1,4,9,1,4,8,4,5,6,7]];
var k42=[[1,1,1,1,1,2,3,4,5,6,7,7,7,7,7,7,7],[1,2,3,4,5,10,10,10,9,8,1,2,3,4,5,6,7]];
var k43=[[1,2,2,2,3,3,3,3,3,6,6,6,6,6,6,6,6,6,6,7,8,9,10],[10,7,8,9,2,3,4,5,6,1,2,3,4,5,6,7,8,9,10,10,9,9,8]];
var k44=[[2,2,2,2,2,2,2,2,2,2,3,4,5,6,7,7],[1,2,3,4,5,6,7,8,9,10,10,10,9,8,6,7]];
var k45=[[1,1,1,1,1,1,1,1,1,2,2,3,3,4,4,5,5,6,6,7,7,8,8,9,9,9,9,9,9,9,9,9],[2,3,4,5,6,7,8,9,10,2,10,2,10,2,10,2,10,2,10,2,10,2,10,2,3,4,5,6,7,8,9,10]];
var k46=[[1,1,1,1,2,3,4,4,5,5,6,6,7,7,8,8,9,9,10,10,10,10,10,10,10],[1,2,3,4,1,1,1,10,1,10,1,10,1,9,1,9,1,8,1,2,3,4,5,6,7]];
var k47=[[1,2,2,3,3,3,3,4,4,5,5,6,6,6,6,6,6,6,6,6,6,7,7,8,8,9,9,10],[6,3,6,3,4,5,6,3,6,3,6,1,2,3,4,5,6,7,8,9,10,3,6,3,6,3,6,6]];
var k49=[[1,2,2,3,3,4,4,5,5,5,5,5,6,6,6,7,7,7,8,8,8,9,9,9,10],[10,2,10,2,10,2,10,2,7,8,9,10,2,6,10,2,5,10,2,4,10,2,3,10,10]];
var k50=[[1,1,2,2,3,3,3,4,4,4,5,5,5,6,6,6,7,7,7,8,8,8,9,9,9,10,10,10,10,10,10],[1,4,1,4,1,4,10,1,4,10,1,4,10,1,4,9,1,4,9,1,4,8,1,4,7,1,2,3,4,5,6]];
var k51=[[1,1,2,2,3,3,4,4,5,5,6,7,8,9,10,10,10,10,10,10],[3,10,3,10,3,10,3,10,3,10,10,10,9,8,2,3,4,5,6,7]];
var k52=[[1,1,1,1,2,3,3,3,3,4,5,6,6],[5,6,7,10,10,5,6,7,10,9,8,6,7]];
var k53=[[1,2,2,2,2,2,3,4,4,5,5],[7,6,7,8,9,10,7,7,9,7,8]];
var k54=[[1,2,2,3,3,4,4,4,4,4,5],[10,6,10,6,10,6,7,8,9,10,10]];
var k55=[[1,1,1,2,2,2,3,3,3,4,4,4,4,4],[6,8,10,6,8,10,6,8,10,6,7,8,9,10]];
var k56=[[1,1,2,2,2,3,4,4,5,5],[6,10,6,8,9,6,6,8,6,7]];
var k57=[[1,2,3,3,3,3,4],[9,8,7,8,9,10,6]];
var k58=[[1,1,2,3,3,3,4,4,5,5,5],[7,8,7,6,7,10,7,10,7,8,9]];
var k59=[[1,1,2,2,3,3,3,3,4,4,5,5],[7,10,7,10,7,8,9,10,7,10,7,10]];
var k60=[[1,1,2,2,3,3,4,4,4,4,4,5],[7,10,7,9,7,8,6,7,8,9,10,7]];
var kch=[[1,2,3,4,5,6,7,8,9,10],[6,6,6,6,6,6,6,6,6,6]];
var h01=[[1,1,1,1,2,2,2,3,3,3,4,4,4,4,4,4,4,4,5,5,5,6,6,6,6,7,7,7,8,8,9,9,10,10,10],[2,7,8,9,2,6,10,2,5,10,1,2,3,4,5,6,7,9,2,5,8,2,5,7,9,2,5,6,4,5,6,10,7,8,9]];
var h02=[[1,1,1,1,1,1,1,2,2,3,4,9,9,10,10,10,10,10],[2,3,4,5,6,7,8,1,9,10,9,2,3,4,5,6,7,8]];
var h03=[[1,2,2,3,3,4,4,4,5,5,5,6,6,6,7,7,8,8,8,8,8],[4,1,4,1,3,1,3,10,1,3,10,1,3,10,3,9,4,5,6,7,8]];
var h04=[[1,2,2,3,3,4,4,4,4,5,5,5,5,6,6,6,6,7,7,7,7,8,8,9,10],[10,4,9,4,8,1,4,7,8,1,4,6,8,1,4,6,8,2,4,5,9,4,10,10,10]];
var h05=[[1,1,1,2,2,2,3,3,3,4,4,4,4,4,4,4,4,4,5,5,6,6,7,7,8,8,9,9,9,10,10,10,10,10],[7,8,9,3,6,10,3,6,10,1,2,3,4,5,6,7,8,9,3,5,3,5,3,5,5,10,2,6,10,3,4,7,8,9]];
var h06=[[1,1,2,2,2,3,3,3,3,3,3,3,4,4,5,5,6,6,7,7,7,7,7,8,9,10,10,10,10],[4,10,4,8,9,1,2,3,4,5,6,7,3,10,3,10,3,9,4,5,6,7,8,1,2,3,4,5,6]];
var h07=[[1,1,1,1,2,2,2,3,3,3,4,4,4,4,5,5,5,5,5,6,6,6,7,7,7,7,8,8,9],[2,5,7,8,2,5,9,2,5,10,1,2,5,10,2,3,4,5,10,2,5,6,2,5,7,8,2,5,5]];
var h08=[[1,1,2,2,3,3,4,4,5,5],[5,6,4,7,3,8,2,9,1,10]];
var h09=[[1,1,1,1,1,1,1,1,2,2,3,5,6,7,7,8,8,8,8,8,8,8,8,8,9,10],[2,3,4,5,6,7,8,9,1,10,9,3,3,3,10,1,2,3,4,5,6,7,8,9,3,3]];
var h10=[[1,1,2,2,3,3,4,4,5,5,6,6,7,7,8,8,9,9,10,10],[2,9,1,9,1,10,1,10,1,10,1,10,1,10,1,10,2,10,2,10]];
var h11=[[1,1,1,2,2,3,3,4,4,5,5,5,5,6,6,6,6,7,7,8,8,9,10],[2,7,8,2,9,2,10,2,10,1,2,3,10,2,4,5,10,2,6,2,7,2,2]];
var h12=[[1,2,2,2,2,2,2,2,3,4,5,6,7,8,9,9],[1,2,3,4,5,6,7,8,9,10,10,10,10,9,7,8]];
var h13=[[1,2,3,3,3,4,4,4,4,5,5,5,5,6,6,6,6,6,6,6,6,7,8,9,10],[2,2,2,5,6,2,4,7,10,2,4,7,9,1,2,3,4,5,6,7,8,2,2,2,2]];
var h14=[[1,2,3,3,3,3,3,3,3,3,4,4,5,5,6,6,6,7,7,7,7,7,7,7,8,8,9,10],[3,3,1,2,3,4,5,6,7,8,3,9,3,10,3,6,10,1,2,3,4,5,6,10,3,10,3,3]];
var h15=[[1,2,3,3,3,3,4,4,4,4,5,5,5,5,6,6,6,6,7,7,7,8,9,10],[5,5,1,5,7,8,1,5,6,9,1,4,5,10,1,3,5,10,1,2,5,5,5,5]];
var h16=[[1,1,1,1,2,2,2,2,3,3,3,3,4,4,5,5,5,6,6,6,7,7,7,8,8,8,9,9],[3,8,9,10,3,5,6,7,1,2,3,4,3,9,3,5,10,3,5,10,3,5,10,3,5,10,6,10]];
var h17=[[1,2,3,3,3,3,4,4,4,4,4,4,5,5,5,6,6,6,7,7,7,8,8,8,8],[3,3,3,5,6,7,1,2,3,4,6,10,3,6,10,3,6,10,3,6,10,3,7,8,9]];
var h18=[[1,2,3,4,5,5,6,6,7,7,8,8,9,9,10,10,10,10],[4,4,4,3,3,10,3,10,3,10,3,10,4,9,5,6,7,8]];
var h19=[[1,2,3,4,4,4,4,4,5,5,5,6,6,6,7,7,7,8,8,8,9],[2,2,2,1,5,6,7,8,1,4,9,1,3,10,1,3,10,1,2,10,1]];
var h20=[[1,1,1,1,1,2,2,2,2,3,3,4,4,5,5,6,6,7,7,8,8],[1,2,7,8,9,3,4,6,10,5,10,5,10,4,10,4,10,3,10,3,10]];
var h21=[[1,1,2,2,2,3,3,3,3,4,4,4,4,5,5,5,6,6,7,7,7,7,8,8,9,9,10],[3,7,3,5,6,1,2,3,4,3,8,9,10,3,7,10,7,9,5,6,7,8,2,9,3,10,4]];
var h22=[[1,1,1,1,1,1,1,1,2,2,4,4,5,5,6,6,7,7,8,8,9,9,10,10],[2,3,4,5,6,7,8,9,1,10,2,9,2,10,2,10,2,10,2,10,3,10,3,10]];
var h23=[[1,1,1,1,1,1,2,2,2,3,3,3,4,4,4,5,5,5,6,6,6,7,7,7,7,7,8,8,8,9,9,9,10,10,10,10,10],[2,3,6,7,8,9,4,5,10,4,6,9,3,7,8,3,6,9,3,4,5,1,2,3,8,9,3,7,10,4,8,9,5,6,7,8,10]];
var h24=[[1,1,1,1,2,2,2,2,2,2,2,2,2,2,3,3,3,4,4,5,6,6,6,6,7,7,7,8,8,8,9,9,10,10,10,10,10],[2,6,7,8,1,2,3,4,5,6,7,8,9,10,2,3,6,2,5,4,3,8,9,10,3,7,10,3,8,10,4,9,5,6,7,8,10]];
var h25=[[1,1,1,1,1,2,2,3,3,4,4,5,5,5,5,5,5,5,5,6,7,8,8,9,9,10,10,10,10,10],[4,5,6,7,8,3,9,2,10,2,10,2,3,4,5,6,7,8,9,2,2,2,10,3,9,4,5,6,7,8]];
var h26=[[1,1,1,1,1,1,1,1,2,2,4,4,4,5,5,5,6,6,6,7,7,7,7,7,7,7,7,7,8,8,9,9,10,10,10],[2,3,4,5,6,7,8,9,1,10,2,8,9,2,7,10,2,7,10,1,2,3,4,5,6,7,8,9,2,7,2,8,2,9,10]];
var h27=[[1,2,2,2,2,3,3,3,4,4,4,4,4,5,5,6,7,8,8,8,8,8,8,9,10],[4,4,7,8,9,3,6,10,2,3,4,5,10,1,10,10,9,3,4,5,6,7,8,4,5]];
var h28=[[1,2,2,2,4,5,5,5,5,6,6,6,7,7,7,8,8,8,9,10,10,10],[9,6,7,8,10,1,4,5,10,2,6,10,2,7,10,3,8,9,6,7,8,9]];
var h29=[[1,2,3,4,5,6,7,8,9,10],[7,6,5,4,4,5,6,7,8,9]];
var h30=[[1,1,1,1,1,1,1,1,2,2,4,4,4,4,5,5,5,5,6,6,6,6,7,7,7,7,7,7,7,7,7,8,8,8,9,9,9,10,10,10,10],[2,3,4,5,6,7,8,9,1,10,1,3,8,9,1,3,7,10,1,3,7,10,1,2,3,4,5,6,7,8,9,1,3,7,1,3,8,1,3,9,10]];
var h31=[[1,1,1,1,2,2,2,2,3,3,3,3,4,4,4,4,5,5,5,5,5,5,5,5,5,6,6,6,7,7,7,8,8,8,9,9,9],[2,4,8,9,2,4,7,10,2,4,7,10,2,4,7,10,1,2,3,4,5,6,7,8,9,2,4,7,2,4,7,2,4,8,2,4,9]];
var h32=[[1,1,1,1,2,2,2,3,3,3,3,3,3,3,4,4,4,5,5,5,6,6,7,7,8,8,8,8,8,9,9,9,10],[2,7,8,9,1,6,10,1,4,5,6,7,8,9,1,3,5,1,2,5,1,5,5,10,5,6,7,8,9,3,4,6,7]];
var h33=[[1,1,1,2,2,2,3,3,3,3,3,3,3,3,3,4,4,5,5,6,6,7,8,8,9,9,10,10,10,10],[3,7,8,3,6,9,1,2,3,4,5,6,7,8,9,3,10,3,10,3,10,10,1,10,1,9,2,3,7,8]];
var h34=[[1,1,1,1,1,1,2,2,2,3,3,3,4,4,5,5,5,6,6,7,7,7,7,7,8,9,9,10,10,10,10],[2,3,4,7,8,9,5,6,10,5,7,9,4,8,4,7,9,4,6,1,2,3,4,5,4,5,10,6,7,8,9]];
var h35=[[1,1,2,2,3,3,3,3,3,3,3,3,4,4,4,4,5,5,5,6,6,6,7,7,7,8,8],[2,5,2,5,2,3,4,5,6,7,8,9,1,2,5,10,2,5,10,2,5,10,2,5,9,7,8]];
var h36=[[1,2,2,2,2,3,3,3,3,4,4,4,4,5,6,7,7,7,7,7,8,9,9,10,10,10],[5,1,2,3,4,4,5,6,7,3,8,9,10,3,3,1,2,3,4,5,3,3,7,4,5,6]];
var h38=[[1,1,1,1,1,1,2,3,3,4,4,4,5,5,5,6,6,6,6,6,6,6,6,7,7,8,8,9,9,9,9],[3,4,5,6,7,8,5,4,7,3,8,10,3,8,9,1,2,3,4,5,6,7,8,3,8,3,8,4,5,6,7]];
var h40=[[1,1,2,2,3,3,4,4,5,5,5,5,5,5,5,5,5,6,6,7,7,8,8],[8,9,7,10,7,10,7,10,1,2,3,4,5,6,7,8,9,3,8,3,9,3,10]];
var h41=[[1,1,1,1,1,2,3,3,3,4,4,4,5,5,5,6,6,6,6],[3,4,5,6,7,7,1,6,10,1,6,10,2,6,10,3,7,8,9]];
var h42=[[1,1,1,1,1,2,3,4,5,6,7,7,7,7,7,7,7,7],[1,2,3,4,5,6,5,10,10,9,1,2,3,4,5,6,7,8]];
var h43=[[1,2,2,2,3,3,3,3,3,4,4,4,4,4,5,5,5,5,5,5,6,6,6,7,7,8,8],[6,1,5,9,1,4,5,8,10,1,3,5,8,10,1,2,5,8,9,10,1,5,10,6,9,7,8]];
var h44=[[1,1,2,2,2,2,2,2,2,2,2,2,3,3,3,4,5,6,6,7,8,8,8,8,8,8,9,9,9,10,10],[3,8,1,2,3,4,5,6,7,8,9,10,3,4,7,6,5,3,4,3,3,6,7,8,9,10,4,5,10,8,9]];
var h45=[[1,2,2,3,3,3,3,4,4,4,4,5,5,5,5,6,6,6,7,7,7,8,8,8],[6,1,5,1,4,5,10,1,3,5,10,1,2,5,10,1,5,10,1,5,9,6,7,8]];
var h46=[[1,1,2,2,2,3,3,3,3,3,3,3,3,3,3,4,4,4,5,5,6,7,8,9,9,10,10,10],[3,9,3,7,8,1,2,3,4,5,6,7,8,9,10,3,4,6,3,6,5,5,5,6,10,7,8,9]];
var h47=[[1,1,1,2,2,2,3,3,3,4,4,4,4,5,5,5,5,6,6,6,6,6,7,7,7,8,8,8,9,9,10,10],[7,8,9,1,6,10,1,5,9,1,5,7,8,1,4,5,6,1,2,3,5,9,5,8,10,5,8,10,6,9,7,8]];
var h49=[[1,1,2,2,3,3,3,4,4,4,4,5,5,5,6,6,6,6,6,7,7,7,7,7,8,8,8,8,8,9,9,9,9,10],[9,10,7,8,1,6,8,1,4,5,8,1,3,9,1,2,3,6,10,1,3,5,7,10,1,3,5,7,9,4,5,6,9,10]];
var h50=[[1,2,2,3,3,3,3,3,4,4,4,4,4,5,5,5,5,5,6,6,6,6,7,7,7,7],[6,2,5,2,4,5,8,9,2,3,5,7,10,1,2,5,6,10,2,6,7,10,2,5,8,10]];
var h51=[[1,1,1,2,2,3,3,3,3,4,4,4,5,6,6,7,8,9,10,10],[8,9,10,6,7,3,4,5,7,1,2,7,7,8,9,10,10,9,7,8]];
var h52=[[1,1,1,2,2,2,2,3,3,4,5,5,5],[7,9,10,6,7,8,10,7,9,8,7,9,10]];
var h53=[[1,1,1,2,3,4,5,5],[7,8,9,10,9,7,8,9]];
var h54=[[1,2,2,2,3,3,3,4,4,5,5],[7,5,7,10,5,7,10,7,10,8,9]];
var h55=[[1,1,2,2,2,3,3,3,4,4,4,5,5],[7,10,5,7,9,5,7,9,7,8,10,7,10]];
var h56=[[1,1,1,2,2,2,2,2,3,3,4,5,5],[7,9,10,6,7,8,9,10,7,9,9,7,10]];
var h57=[[1,2,2,2,2,2,3,4,4,4,5],[7,6,7,8,9,10,7,5,7,9,8]];
var h58=[[1,1,1,1,2,3,3,3,3,3,4,4,5,5],[6,7,8,9,7,6,7,8,9,10,7,9,8,9]];
var h59=[[1,1,1,2,2,3,3,3,3,4,4,5,5],[8,9,10,8,10,6,7,8,9,7,9,7,10]];
var h60=[[1,2,3,3,4,4,5,5],[7,7,7,10,7,10,8,9]];
var c01=[[1,1,2,2,3,3,4,4,5,5,5,5,5,5,5,5,5,5,6,6,7,7,8,8,9,9,10,10],[3,8,3,7,3,6,3,5,1,2,3,4,5,6,7,8,9,10,3,5,3,6,3,7,3,8,3,9]];
var c02=[[1,1,1,1,1,1,1,1,1,2,2,2,3,3,3,4,4,4,5,5,5,6,6,6,7,7,7,7,7,7,7,7,7],[1,2,3,4,5,6,7,8,9,1,5,9,1,5,9,1,5,9,1,5,9,1,5,9,1,2,3,4,5,6,7,8,9]];
var c03=[[1,2,3,3,3,3,3,3,3,3,4,4,4,5,5,5,6,6,6,6,7,7,7,7,8,8,8,8,8,8,8,8,8,8],[10,9,1,2,3,4,5,6,7,8,1,4,6,1,4,6,1,4,6,9,1,4,6,10,1,2,3,4,5,6,7,8,9,10]];
var c04=[[1,1,2,2,3,3,3,3,3,4,5,5,5,5,5,5,5,5,5,5,6,7,7,7,8,8,9],[4,9,4,8,4,5,6,7,10,10,1,2,3,4,5,6,7,8,9,10,5,4,6,7,3,8,9]];
var c05=[[1,1,1,1,2,3,3,4,4,4,4,4,4,4,5,6,7,7,8,8,8],[3,4,5,10,9,7,8,1,2,3,4,5,6,7,7,8,5,9,3,4,10]];
var c06=[[1,2,2,3,3,3,3,3,4,4,4,4,5,5,5,5,5,5,5,5,6,6,6,6,7,7,7,7,7,8,8,9],[4,3,10,2,4,6,8,10,1,4,6,10,1,4,5,6,7,8,9,10,1,4,6,10,2,4,6,8,10,3,10,4]];
var c07=[[1,2,2,3,3,4,4,5,5,5,5,5,5,5,5,6,6,7,7,8,8,9],[9,5,9,5,9,5,9,2,3,4,5,6,7,8,9,5,9,5,9,5,9,9]];
var daku=[[1,1,1,3,3,3],[1,2,3,1,2,3]];
var han=[[1,1,1,2,2,3,3,3],[1,2,3,1,3,1,2,3]];
    str += "";
    var code = [];
  for (var int = 0; int < str.length; int++){
    var key=str.substring(int,int+1);//i番目の文字を描画
    switch(key){
      case " ":SP();break;case '　':SP();break;case "a":draw(a);break;case "b":draw(b);break;
      case "c":draw(c);break;case "d":draw(d);break;case "e":draw(e);break;case "f":draw(f);break;
      case "g":draw(g);break;case "h":draw(h);break;case "i":draw(i);break;case "j":draw(j);break;
      case "k":draw(k);break;case "l":draw(l);break;case "m":draw(m);break;case "n":draw(n);break;
      case "o":draw(o);break;case "p":draw(p);break;case "q":draw(q);break;case "r":draw(r);break;
      case "s":draw(s);break;case "t":draw(t);break;case "u":draw(u);break;case "v":draw(v);break;
      case "w":draw(w);break;case "x":draw(x);break;case "y":draw(y);break;case "z":draw(z);break;
      case "A":draw(A);break;case "B":draw(B);break;case "C":draw(C);break;case "D":draw(D);break;
      case "E":draw(E);break;case "F":draw(F);break;case "G":draw(G);break;case "H":draw(H);break;
      case "I":draw(I);break;case "J":draw(J);break;case "K":draw(K);break;case "L":draw(L);break;
      case "M":draw(M);break;case "N":draw(N);break;case "O":draw(O);break;case "P":draw(P);break;
      case "Q":draw(Q);break;case "R":draw(R);break;case "S":draw(S);break;case "T":draw(T);break;
      case "U":draw(U);break;case "V":draw(V);break;case "W":draw(W);break;case "X":draw(X);break;
      case "Y":draw(Y);break;case "Z":draw(Z);break;case "1":draw(n1);break;case "2":draw(n2);break;
      case "3":draw(n3);break;case "4":draw(n4);break;case "5":draw(n5);break;case "6":draw(n6);break;
      case "7":draw(n7);break;case "8":draw(n8);break;case "9":draw(n9);break;case "0":draw(n0);break;
      case "ａ":draw(a);break;case "ｂ":draw(b);break;case "ｃ":draw(c);break;case "ｄ":draw(d);break;
      case "ｅ":draw(e);break;case "ｆ":draw(f);break;case "ｇ":draw(g);break;case "ｈ":draw(h);break;
      case "ｉ":draw(i);break;case "ｊ":draw(j);break;case "ｋ":draw(k);break;case "ｌ":draw(l);break;
      case "ｍ":draw(m);break;case "ｎ":draw(n);break;case "ｏ":draw(o);break;case "ｐ":draw(p);break;
      case "ｑ":draw(q);break;case "ｒ":draw(r);break;case "ｓ":draw(s);break;case "ｔ":draw(t);break;
      case "ｕ":draw(u);break;case "ｖ":draw(v);break;case "ｗ":draw(w);break;case "ｘ":draw(x);break;
      case "ｙ":draw(y);break;case "ｚ":draw(z);break;case "Ａ":draw(A);break;case "Ｂ":draw(B);break;
      case "Ｃ":draw(C);break;case "Ｄ":draw(D);break;case "Ｅ":draw(E);break;case "Ｆ":draw(F);break;
      case "Ｇ":draw(G);break;case "Ｈ":draw(H);break;case "Ｉ":draw(I);break;case "Ｊ":draw(J);break;
      case "Ｋ":draw(K);break;case "Ｌ":draw(L);break;case "Ｍ":draw(M);break;case "Ｎ":draw(N);break;
      case "Ｏ":draw(O);break;case "Ｐ":draw(P);break;case "Ｑ":draw(Q);break;case "Ｒ":draw(R);break;
      case "Ｓ":draw(S);break;case "Ｔ":draw(T);break;case "Ｕ":draw(U);break;case "Ｖ":draw(V);break;
      case "Ｗ":draw(W);break;case "Ｘ":draw(X);break;case "Ｙ":draw(Y);break;case "Ｚ":draw(Z);break;
      case "１":draw(n1);break;case "２":draw(n2);break;case "３":draw(n3);break;case "４":draw(n4);break;
      case "５":draw(n5);break;case "６":draw(n6);break;case "７":draw(n7);break;case "８":draw(n8);break;
      case "９":draw(n9);break;case "０":draw(n0);break;case "\.":draw(peri);break;case "\,":draw(con);break;
      case "\!":draw(ex);break;case "\?":draw(qu);break;case "\-":draw(bar);break;case "\'":draw(apo);break;
      case "\:":draw(colo);break;case "\;":draw(semi);break;case "\*":draw(asta);break;case "\(":draw(lpar);break;
      case "\)":draw(rpar);break;case "\<":draw(lbra);break;case "\>":draw(rbra);break;case "\n":CR();break;
      case 'ア':draw(k01);break;case 'イ':draw(k02);break;case 'ヴ':draw(k03);draw(daku);break;case 'ウ':draw(k03);break;
      case 'エ':draw(k04);break;case 'オ':draw(k05);break;case 'カ':draw(k06);break;case 'キ':draw(k07);break;
      case 'ク':draw(k08);break;case 'ケ':draw(k09);break;case 'コ':draw(k10);break;case 'サ':draw(k11);break;
      case 'シ':draw(k12);break;case 'ス':draw(k13);break;case 'セ':draw(k14);break;case 'ソ':draw(k15);break;
      case 'タ':draw(k16);break;case 'チ':draw(k17);break;case 'ツ':draw(k18);break;case 'テ':draw(k19);break;
      case 'ト':draw(k20);break;case 'ガ':draw(k06);draw(daku);break;case 'ギ':draw(k07);draw(daku);break;
      case 'グ':draw(k08);draw(daku);break;case 'ゲ':draw(k09);draw(daku);break;case 'ゴ':draw(k10);draw(daku);break;
      case 'ザ':draw(k11);draw(daku);break;case 'ジ':draw(k12);draw(daku);break;case 'ズ':draw(k13);draw(daku);break;
      case 'ゼ':draw(k14);draw(daku);break;case 'ゾ':draw(k15);draw(daku);break;case 'ダ':draw(k16);draw(daku);break;
      case 'ヂ':draw(k17);draw(daku);break;case 'ヅ':draw(k18);draw(daku);break;case 'デ':draw(k19);draw(daku);break;
      case 'ド':draw(k20);draw(daku);break;case 'ナ':draw(k21);break;case 'ニ':draw(k22);break;
      case 'ヌ':draw(k23);break;case 'ネ':draw(k24);break;case 'ノ':draw(k25);break;
      case 'ハ':draw(k26);break;case 'ヒ':draw(k27);break;case 'フ':draw(k28);break;
      case 'ヘ':draw(k29);break;case 'ホ':draw(k30);break;case 'パ':draw(k26);draw(han);break;
      case 'ピ':draw(k27);draw(han);break;case 'プ':draw(k28);draw(han);break;case 'ペ':draw(k29);draw(han);break;
      case 'ポ':draw(k30);draw(han);break;case 'バ':draw(k26);draw(daku);break;case 'ビ':draw(k27);draw(daku);break;
      case 'ブ':draw(k28);draw(daku);break;case 'ベ':draw(k29);draw(daku);break;case 'ボ':draw(k30);draw(daku);break;
      case 'マ':draw(k31);break;case 'ミ':draw(k32);break;case 'ム':draw(k33);break;case 'メ':draw(k34);break;
      case 'モ':draw(k35);break;case 'ヤ':draw(k36);break;case 'ユ':draw(k38);break;case 'ヨ':draw(k40);break;
      case 'ラ':draw(k41);break;case 'リ':draw(k42);break;case 'ル':draw(k43);break;case 'レ':draw(k44);break;
      case 'ロ':draw(k45);break;case 'ワ':draw(k46);break;case 'ヰ':draw(k47);break;case 'ヱ':draw(k49);break;
      case 'ヲ':draw(k50);break;case 'ン':draw(k51);break;case 'ッ':draw(k52);break;case 'ャ':draw(k53);break;
      case 'ュ':draw(k54);break;case 'ョ':draw(k55);break;case 'ァ':draw(k56);break;case 'ィ':draw(k57);break;
      case 'ゥ':draw(k58);break;case 'ェ':draw(k59);break;case 'ォ':draw(k60);break;case 'ー':draw(kch);break;
      case 'あ':draw(h01);break;case 'い':draw(h02);break;case 'う':draw(h03);break;case 'え':draw(h04);break;
      case 'お':draw(h05);break;case 'か':draw(h06);break;case 'き':draw(h07);break;case 'く':draw(h08);break;
      case 'け':draw(h09);break;case 'こ':draw(h10);break;case 'さ':draw(h11);break;case 'し':draw(h12);break;
      case 'す':draw(h13);break;case 'せ':draw(h14);break;case 'そ':draw(h15);break;case 'た':draw(h16);break;
      case 'ち':draw(h17);break;case 'つ':draw(h18);break;case 'て':draw(h19);break;case 'と':draw(h20);break;
      case 'が':draw(h06);draw(daku);break;case 'ぎ':draw(h07);draw(daku);break;case 'ぐ':draw(h08);draw(daku);break;
      case 'げ':draw(h09);draw(daku);break;case 'ご':draw(h10);draw(daku);break;case 'ざ':draw(h11);draw(daku);break;
      case 'じ':draw(h12);draw(daku);break;case 'ず':draw(h13);draw(daku);break;case 'ぜ':draw(h14);draw(daku);break;
      case 'ぞ':draw(h15);draw(daku);break;case 'だ':draw(h16);draw(daku);break;case 'ぢ':draw(h17);draw(daku);break;
      case 'づ':draw(h18);draw(daku);break;case 'で':draw(h19);draw(daku);break;case 'ど':draw(h20);draw(daku);break;
      case 'な':draw(h21);break;case 'に':draw(h22);break;case 'ぬ':draw(h23);break;case 'ね':draw(h24);break;
      case 'の':draw(h25);break;case 'は':draw(h26);break;case 'ひ':draw(h27);break;case 'ふ':draw(h28);break;
      case 'へ':draw(h29);break;case 'ほ':draw(h30);break;case 'ぱ':draw(h26);draw(han);break;
      case 'ぴ':draw(h27);draw(han);break;case 'ぷ':draw(h28);draw(han);break;case 'ぺ':draw(h29);draw(han);break;
      case 'ぽ':draw(h30);draw(han);break;case 'ば':draw(h26);draw(daku);break;case 'び':draw(h27);draw(daku);break;
      case 'ぶ':draw(h28);draw(daku);break;case 'べ':draw(h29);draw(daku);break;case 'ぼ':draw(h30);draw(daku);break;
      case 'ま':draw(h31);break;case 'み':draw(h32);break;case 'む':draw(h33);break;case 'め':draw(h34);break;
      case 'も':draw(h35);break;case 'や':draw(h36);break;case 'ゆ':draw(h38);break;case 'よ':draw(h40);break;
      case 'ら':draw(h41);break;case 'り':draw(h42);break;case 'る':draw(h43);break;case 'れ':draw(h44);break;
      case 'ろ':draw(h45);break;case 'わ':draw(h46);break;case 'ゐ':draw(h47);break;case 'ゑ':draw(h49);break;
      case 'を':draw(h50);break;case 'ん':draw(h51);break;case 'ぁ':draw(h52);break;case 'ぃ':draw(h53);break;
      case 'ぅ':draw(h54);break;case 'ぇ':draw(h55);break;case 'ぉ':draw(h56);break;case 'ゃ':draw(h57);break;
      case 'ゅ':draw(h58);break;case 'ょ':draw(h59);break;case 'っ':draw(h60);break;case '木':draw(c01);break;
      case '日':draw(c02);break;case '月':draw(c03);break;case '水':draw(c04);break;case '火':draw(c05);break;
      case '金':draw(c06);break;case '土':draw(c07);break;default:draw(def);break
    }
  }
    function draw(id) {
      var sp = 2;
      var num=Math.max.apply(null, id[0]) + sp;
      if(pos+num*7>returnX){CR()}          //改行チェック
      for (var int = 0; int < id[0].length; int++){
        var X=id[0][int];
        var Y=id[1][int];
        code.push([X*7+pos, Y*7+line]);
      }
      pos=pos+num*7;
    }
    function SP(){ //空白
      pos+=50;
    }
    function CR(){ //改行
      var lh=85;
      pos=posx;
      line += lh;
    }
    for(var i=0; i<code.length; i++){
      this.drawDot(code[i][0],code[i][1]);
    }
  },

  drawLine:function(x1, y1, x2, y2) {     ////点線の描画処理///
    if(y2 === undefined)return this.drawLine(fromX, fromY, x1, y1);
    fromX = x2;
    fromY = y2;
    var d = Math.sqrt(Math.pow(x2 - x1, 2) + Math.pow(y2 - y1, 2));
    var rad = Math.atan2(y2 - y1, x2 - x1);
    var dotted = Math.round(d / interval );
    for (var i = 0; i < dotted; i++) {
      var x3 = Math.cos(rad) * interval * i + x1;
      var y3 = Math.sin(rad) * interval * i + y1;
      this.drawDot(x3, y3);
    }
  },

  strokeRect:function(x, y, w, h) {   ////長方形の描画処理①///
    this.drawDot(x + w, y + h);
    this.drawLine(x, y , x+w, y);
    this.drawLine(x, y , x, y+h);
    this.drawLine(x+w, y , x+w, y+h);
    this.drawLine(x, y+h , x+w, y+h);
  },

  fillRect:function(x, y, w, h) {     ////長方形の描画処理②///
    if(w<0){w*=-1; x-=w;}
    if(h<0){h*=-1; y-=h}
    var s = 3;
    var j = Math.round(h /s /2 );
    for (var i = 0; i <= j; i++) {
      this.drawLine(x, y + s*i*2, x+w, y + s*i*2);
    }
  },

  strokeCircle:function(x, y, r) {     ////円の描画処理///
    var cir = 2 * Math.PI * r;
    var a = 360 / Math.round(cir / interval); // 角度（度)
    
    for(var i=0; a*i < 360; i++){
      var X = x + r * Math.cos(a*i / 180 * Math.PI); // X座標
      var Y = y + r * Math.sin(a*i / 180 * Math.PI); // Y座標
      this.drawDot(X, Y);
    }
  }, 

  drawPattern:function(code, x, y) {     ////図形の描画処理///
    var len = code.length;
    for(var i=0; i < len; i++){
      this.drawDot(code[i][0]+x, code[i][1]+y);
    }
  },

  drawDot:function(x,y) {               /////点の描画///////
    x = Math.round(x);
    y = Math.round(y);
    if(ctx){
      ctx.beginPath();
      ctx.arc(x, y, 1, 0, Math.PI*2, false);
      ctx.fill();
    }
    arr.push(y*1000 + x);
  },

  clearDot:function(x,y) {               /////点の削除///////
    if(ctx){
      ctx.fillStyle = '#fff';
      ctx.beginPath();
      ctx.arc(x, y, 1, 0, Math.PI*2, false);
      ctx.fill();
      ctx.fillStyle = '#000';
    }
    var target = y*1000 + x;
    arr = arr.filter(function(v){
      return v !== target;
    });
  },

  clear:function(){
    arr=[];
    var fromX = 0;
    var fromY = 0;
    ctx.clearRect(0, 0, sizeX, sizeY);
  },
             /////////////入出力系メソッド//////////////////

  loadEdl:function() {              //////エーデルファイルの出力///////
    arr.sort(function(a,b){
      if( a < b ) return -1;
      if( a > b ) return 1;
      return 0;
    });
    var str = "";
    var len = arr.length;
    for(i=0; i<len; i++){
      var X = arr[i] % 1000;
      var Y = (arr[i] - X) / 1000;
      if(arr[i-1] !== arr[i] && X < sizeX && Y < sizeY){  //重複した座標と領域の外側の座標を除外
        str += num2edi(parseInt(X,10)) + num2edi(parseInt(Y,10));
      }
    }
    function num2edi(num){  //
      var str = num.toString(26);
      str = str.replace(/10(.)/, "Z$1");
      str = str.replace(/11(.)/, "\[$1");
      str = str.replace(/12(.)/, "\\$1");
      var js26 = ['0','1','2','3','4','5','6','7','8','9','a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p'];
      var ed26 = ['@','A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y'];
      for(var i=0; i<26; i++){
        str = str.replace(new RegExp(js26[i],"g"),ed26[i]);
        str= ("@"+str).slice(-2);  //ゼロ埋め
      }
      return str;
    }
    str = "EDEL" + size + "0,740\n2" + str;
    return str;
  },

  map2esa:function(){
    var element = document.createElement("canvas");
    element.setAttribute("width", 599);
    element.setAttribute("height", 744);
    var ctx2 = element.getContext('2d');
    ctx2.fillStyle = '#fff';
    ctx2.fillRect(0, 0, sizeX, sizeY);
    ctx2.fillStyle = '#000';
    var len = arr.length;
    
    for(var i = 0; i<len; i++){
      var X = arr[i] % 1000;
      var Y = (arr[i] - X) / 1000;
      ctx2.fillRect(X,Y,1,1);
    }
    var data = element.toDataURL();
    return data;
  },

  readEdl:function(str){              //////////// エーデルファイルの読み込み//////
    str+=""
    str = str.replace(/^.+?[\n\r]/,"");
    str = str.replace(/[\n\r]/,"");
    str = str.replace(/[0-9]/g,"");
    var edlarr = splitByLength(str, 4);
    var len = edlarr.length;
    for(var i=0; i<len; i++){
      var code = edlarr[i];
      var x = edl2num(code.charAt(0)) * 26 + edl2num(code.charAt(1));
      var y = edl2num(code.charAt(2)) * 26 + edl2num(code.charAt(3));
      this.drawDot(x,y);
    }
    //////////////////////
    function splitByLength(str, length) {
      var resultArr = [];
      if (!str || !length || length < 1) {
        return resultArr;
      }
      var index = 0;
      var start = index;
      var end = start + length;
      while (start < str.length) {
        resultArr[index] = str.substring(start, end);
        index++;
        start = end;
        end = start + length;
      }
      return resultArr;
    }
    //////////////////////
    function edl2num(letter) {
      var ed26 = ['@','A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z','\[','\\','\]','\^','\_'];
      for(var i=0; i<ed26.length; i++){
        if(letter===ed26[i])return i;
      }
    }
  }

  };
};
